# NotchThicknessIsLargerThanLandingWarning Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..NotchThicknessIsLargerThanLandingWarning Property
BuiltInFailures..::..StairRampFailures Class See Also
---
The notch thickness is larger than landing.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId NotchThicknessIsLargerThanLandingWarning { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property NotchThicknessIsLargerThanLandingWarning As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ NotchThicknessIsLargerThanLandingWarning {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace